{
  "_name_or_path": null,
  "architectures": [
    "MHFFNMoEForCausalLM"
  ],
  "bos_token_id": 0,
  "eos_token_id": 0,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "max_position_embeddings": 4096,
  "model_type": "mhffnmoe",
  "num_attention_heads": 12,
  "num_hidden_layers": 10,
  "num_key_value_heads": 12,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.2",
  "use_cache": true,
  "vocab_size": 50432,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "rope_theta": 10000.0,
  "mhffnmoe_num_heads": 8,
  "mhffnmoe_num_kuv_heads": 8,
  "mhffnmoe_num_experts": 8,
  "mhffnmoe_skip_linear": false,
  "mhffnmoe_apply_dot_scaling": false,
  "mhffnmoe_apply_final_scaling": false,
  "mhffnmoe_custom_init": true,
  "mhffnmoe_init_wself_identity": false,
  "mhffnmoe_apply_rmsnorm": false,
  "mhffnmoe_init_w_self_gain": 0.707,
  "mhffnmoe_init_w_self_2_gain": 0.707,
  "mhffnmoe_init_gate_gain": 1.0,
  "mhffnmoe_init_up_gain": 1.0,
  "mhffnmoe_init_down_gain": 1.0,
  "mhffnmoe_init_router_gain": 1.0
}